{
    "taskName": "Bob App 🎨",
    "information": "При проверке задания откройте проверяемый проект на github и склонируйте его локально, запустите проект<br><br>Итеративно пройдитесь по списку требований ниже, проверяя его выполнение в приложении и отмечая соответствующие пункты справа. При обнаружении частично выполненного пункта, оставьте комментарий с помощью функции 'Добавить отзыв'. Добавлять отзывы можно и при выборе других пунктов - по желанию.<br><br>Проверяются только требования, указанные в критериях. Если какой-то момент в критериях не описан, его не проверяем и не оцениваем<br>Все сомнения трактуются на пользу студента<br>Если в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов<br>Если сомневаетесь снимать баллы или нет, не снимайте",
    "criteria": [
      {
        "type": "title",
        "title": "Критерии оценки ⭐️"
      },
      {
        "type": "subtask",
        "text": "Пользователь может (должен иметь возможность, используя готовое приложение) отрисовать изображение по каждому шаблону: tree, landscape, head, planet. \nГотовое изображение максимально точно повторяет описанное в файле дизайна (допустимы малые неточности в местах). ",
        "max": 15
      },
      {
        "type": "subtask",
        "text": "Пользователь может регулировать время отрисовки. Время отрисовки соответствует заданному пользователем. \nНапример, корректным будет случай, когда при настройке длительности отрисовки, равной 5 секундам, отрисовка будет длиться 5 секунд (с точностью до 0.3 секунды). \nНекорректным будет поведение, когда пользователь задал время отрисовки, равное, например, 3 секундам, а следующий цикл отрисовки длился 4 секунды.",
        "max": 15
      },
      {
        "type": "subtask",
        "text": "Пользователь может выбирать цвета для отрисовки. Максимальное количество: 3 цвета, минимальное количество: 0 цветов. При отрисовке обязательно используются либо заданные пользователем цвета, либо цвета по умолчанию. Пользователь может добавлять цвета в выбранные и удалять их из выбранных. Используемые в отрисовке цвета соответствуют выбранным. \nЕсли пользователь выбрал и сохранил цвета красный, жёлтый и cиний, тогда только эти цвета будут использованы в отрисовке. \nНапример, некорректным считается поведение, когда пользователь выбрал и сохранил для отрисовки цвета красный, жёлтый и cиний, а после этого в следующем цикле отрисовке были использованы цвета красный, жёлтый и розовый. \nКорректным будет поведением, когда пользователь выбрал и сохранил цвета, например, красный, жёлтый и cиний, а затем в следующем цикле отрисовки были использованы цвета красный, жёлтый и cиний. ",
        "max": 15
      },
      {
        "type": "subtask",
        "text": "Дизайн готового приложения на устройстве iPhone SE 2nd generation с версией iOS 13.5 в точности соотвествует описанному в файле дизайна.",
        "max": 15
      },
      {
        "type": "subtask",
        "text": "В готовом приложении на устройстве iPhone SE 2nd generation с версией iOS 13.5 можно воспроизвести flow из демонстрационного ролика.",
        "max": 10
      },
      {
        "type": "subtask",
        "text": "Пользователь может экспортировать готовое изображение в приложения Photos и Files в формате PNG.",
        "max": 10
      },
      {
        "type": "subtask",
        "text": "В ходе работы приложения не наблюдаются утечки памяти.",
        "max": 10
      },
      {
        "type": "subtask",
        "text": "Был использован язык Swift для реализации: \n- экрана `Drawings`\n- вспомогательного отображения `Timer`\nИспользование языка Swift предполагает реализацию с его помощью только основных элементов UI и объектов бизнес-логики, с которыми у экрана `Drawings` или у вспомогательного отображения `Timer` происходит **прямое взаимодействие**. Всё, что также описано на языке Swift, но не имеет прямого отношения к данным элементам, должно быть рассмотрено как **нарушение данного критерия**.\nТо есть, например, во вспомогательном отображении `Timer` нужно создать объект типа `NSTimer` (или типа `Timer (который часть Foundation)`) и с помощью совместимости с objc связать эту логику с основным экраном `Artist`. Логику кнопки `Reset` нужно, обратно, связать с элементом `Timer`.\nВ реализации готового приложения необходимо задействовать механизм совместимости языков Swift и Objective-C.\nЕсли экран `Drawings` и вспомогательное отображение `Timer` были реализованы на языке Objective-C, тогда данный пункт не засчитывается и не рассматривается как нарушение.",
        "max": 10
      },    
      {
        "type": "title",
        "title": "Штрафы 🔨"
      },
      {
        "type": "penalty",
        "text": "Язык Swift был использован где-либо ещё, кроме экрана Drawings и вспомогательного отображения Timer. Данный пункт - это нарушения из пункта выше.",
        "max": -10
      },
      {
        "type": "penalty",
        "text": "Для отрисовки изображения по шаблону не был использован объект NSTimer либо для отрисовки изображения были задействованы методы и типы для явной анимации (методы UIView animateWithDuration:... transitionWithView:..., тип UIViewPropertyAnimator, тип CAAnimation и его наследники). \nЭтот пункт не касается типа CALayer, его наследников и их внутреннего поведения. ",
        "max": -10
      },
      {
        "type": "penalty",
        "text": "Объекты NSTimer продолжают работать тогда, когда были замещены другими объектами NSTimer или когда время их работы было завершено. \nНапример, неправильным будет считаться случай, когда после окончания цикла отрисовки соответствующий этому циклу объект NSTimer продолжает работать. ",
        "max": -5
      },
      {
        "type": "penalty",
        "text": "- Приложение не запускается или элементы UI не отображаются так, как это описано в файле дизайна, или невозможно воспроизвести flow из демонстрационного ролика на устройстве `iPhone 8` с версией ниже 13.0 и выше 12.1 (имеется ввиду любая версия меньше 13.0 и, одновременно, выше 12.1).",
        "max": -5
      },
      {
        "type": "penalty",
        "text": "Другие мелкие неточности. Этот критерий отдаётся на волю проверяющего и может включать в себя какие-либо замечания по коду, реализации UI и комплектации проекта. \nЗамечания проверяющего не должны пересекаться с требованиями, пунктами и примерами, описанными в данном файле, в файлах дизайна и представленными в демонстрационном ролике. \nОценка за данный пункт должна быть выставлена только один раз и только когда все остальные пункты из блока критериев были проверены и оценены. Причина выставления данного пункта должна быть максимально объективной и подкреплена примером из проверяемого проекта. \nПроверяющий также должен предоставить свой вариант решения поставленного им замечания. Человек, который получил данное замечание, но не получил достаточный фидбек, требуемый в этом пункте, вправе требовать уточнения по этому критерию у проверяющего. ",
        "max": -5
      }
    ]
  }
  